package com.example.quizapp.Question

import kotlin.random.Random

class GeneralQuestion {
    public fun getAllQuestions():ArrayList<Question>{
        val list = ArrayList<Question>()

        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))



        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))

        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))

        val random = Random.nextInt(2)
        if (random ==0){
            list.reverse()
        }
        return list
    }
}