package com.example.quizapp.Question

import kotlin.random.Random

class GeneralQuestion {
    public fun getAllQuestions():ArrayList<Question>{
        val list = ArrayList<Question>()

        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើប្រទេសមួយណា ដែលមានទំហំផ្ទៃដីធំជាងគេ លំដាប់ទី២ក្នុងពិភពលោក?"
            ,"ប្រទេសអូស្ត្រាលី"
            ,"ប្រទេសកាណាដា"
            ,"ប្រទេសចិន"
            ,"ប្រទេសកាណាដា"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))



        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម ប្រទេសខាងក្រោមមួយណាដែលមិនមែនស្ថិតនៅក្នងទ្វីប អឺរ៉ុប?"
            ,"ប្រទេសអេស្សុីប"
            ,"ប្រទេសប៉ូឡូញ"
            ,"ប្រទេសអេស្ប៉ាញ"
            ,"ប្រទេសអេស្សុីប"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម ប្រទេសខាងក្រោមមួយណាដែលមិនមែនស្ថិតនៅក្នងទ្វីប អាសុី?"
            ,"ប្រទេសចិន"
            ,"ប្រទេសប៉ាគីស្ថាន"
            ,"ប្រទេសបារាំង"
            ,"ប្រទេសបារាំង"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))


        //
        list.add(Question(
            "តើក្នុងចំណោម មហាសមុទ្រខាងក្រោមមួយណាដែលមានទំហំធំជាងគេ?"
            ,"មហាសមុទ្រ ឥណ្ឌា"
            ,"មហាសមុទ្រ អាត្លង់តិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
            ,"មហាសមុទ្រ ប៉ាសុីភិច"
        ))

        //
        list.add(Question(
            "តើក្នុងចំណោម ប្រទេសខាងក្រោមមួយណាដែលមិនមែនជាសមាជិក អាស៊ាន?"
            ,"ប្រទេសថៃ"
            ,"ប្រទេសវៀតណាម"
            ,"ប្រទេសជប៉ុន"
            ,"ប្រទេសជប៉ុន"
        ))

        val random = Random.nextInt(2)
        if (random ==0){
            list.reverse()
        }
        return list
    }
}