package com.example.quizapp.question

import android.util.Log
import kotlin.random.Random

class MathQuestion {

    fun getAllQuestions():ArrayList<Question>{
        val list = ArrayList<Question>()
        //
        list.add(Question(
            "ចូរគណនាកន្សោមខាងក្រោម\n" +
                    "2010² - 2000² = ?"
            ,"100"
            ,"40100"
            ,"41000"
            ,"40100"
        ))


        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ y បើ x = 5\n" +
                        "y = 4x² + 5x - 16"
                ,"116"
                ,"125"
                ,"109"
                ,"109"
            ))

        //
        list.add(
            Question(
                "ចូរដោះស្រាយប្រព័ន្ធសមីការខាងក្រោម\n"+
                        "x + 9y = 0\n" +
                        "x + 3y = 6",
                "(x , y) = (9,-1)",
                "(x , y) = (-9,-1)",
                "(x , y) = (-1,9)",
                 "(x , y) = (9,-1)"
            )
        )

        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ y បើ x = 2\n" +
                        "y = 4x³ + 5x² - 16x + 3"
                ,"25"
                ,"23"
                ,"26"
                ,"23"
            ))

        //
        list.add(
            Question(
            "79% នៃ 1236 ស្មើនិង? "
            ,"996.55"
            ,"986.44"
            ,"976.44"
            ,"976.44"
        )
        )

        //
        list.add(Question(
            "ចូរគណនាកន្សោមខាងក្រោម\n" +
                    "(111² - 110²) x 3 = ?"
            ,"646"
            ,"663"
            ,"636"
            ,"663"
        ))

        //
        list.add(
            Question(
                "ចូរដោះស្រាយប្រព័ន្ធសមីការខាងក្រោម\n"+
                        "3x + 2y =15\n" +
                        "6x + 5y = -12",
                "(x , y) = (33,41)",
                "(x , y) = (42,33)",
                "(x , y) = (33,-42)",
                "(x , y) = (33,-42)"
            )
        )


        //
        list.add(
            Question(
                "ចូរគណនាកន្សោមខាងក្រោម\n" +
                        "230 -220x0.5 = ?",
                "130",
                "5",
                "120" ,
                "120"
        ))

        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ u\n" +
                        "បើ 4x+16=12",
                "1",
                "-1",
                "-2" ,
                "1"
            )
        )

        //
        list.add(
            Question(
                "ចូរគណនាកន្សោមខាងក្រោម\n" +
                        "40÷5 -2(4+6) = ?",
                "-12",
                "12",
                "-16" ,
                "-12"
        ))

        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ y បើ x = -3\n" +
                        "y = 3x² - 4x + 6"
                ,"45"
                ,"33"
                ,"54"
                ,"45"
            ))

        //
        list.add(
            Question(
                "ចូរដោះស្រាយប្រព័ន្ធសមីការខាងក្រោម\n"+
                        "x + y =7\n" +
                        "x + 5y = 11",
                "(x , y) = (1,6)",
                "(x , y) = (6,1)",
                "(x , y) = (-1,6)",
                "(x , y) = (6,1)"
            )
        )

        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ u\n" +
                        "បើ 7u+14=3u+6",
                "4",
                "-3",
                "-2" ,
                "-2"
            )
        )

        //
        list.add(
            Question(
            "ចូរគណនាកន្សោមខាងក្រោម\n" +
                    "(125² - 88²) ÷ 3 = ?"
            ,"2627"
            ,"2666"
            ,"2726"
            ,"2627"
        )
        )

        //
        list.add(
            Question(
                "ចូរដោះស្រាយប្រព័ន្ធសមីការខាងក្រោម\n"+
                        "x + 3y =12\n" +
                        "x + 5y = 10",
                "(x , y) = (10,6)",
                "(x , y) = (15,-1)",
                "(x , y) = (-1,15)",
                "(x , y) = (15,-1)"
            )
        )

        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ n\n" +
                        "បើ 3n=-6",
                "-1",
                "-2",
                "2" ,
                "-2"
        ))

        //
        list.add(Question(
            "ចូរគណនាកន្សោមខាងក្រោម\n" +
                    "2022² - 2010² - 1200 = ?"
            ,"47184"
            ,"48384"
            ,"-1056"
            ,"47184"
        ))

        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ z\n" +
                        "បើ 8z+8=32",
                "2",
                "-3",
                "3" ,
                "3"
            ))
        //
        list.add(
            Question(
                "37% នៃ 125 ស្មើនិង?",
                "37.25",
                "46.25",
                "38.25" ,
                "46.25"
            )
        )
        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ z\n" +
                        "បើ 4z+8=12",
                "1",
                "-1",
                "3" ,
                "1"
        ))

        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ y បើ x = 1\n" +
                        "y = 9x² - 4x + 1"
                ,"5"
                ,"6"
                ,"7"
                ,"6"
            ))

        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ u\n" +
                        "បើ 5u+15=3u+5",
                "5",
                "-5",
                "-6" ,
                "-5"
            )
        )

        //
        list.add(
            Question(
            "ចូរគណនាតម្លៃ B បើ A = 4\n" +
                    "B = 3A² + 4A -6"
            ,"58"
            ,"64"
            ,"154"
            ,"58"
        ))

        //
        list.add(
            Question(
                "ចូរគណនាតម្លៃ n\n" +
                        "បើ 3n - 6 = -6",
                "0",
                "1",
                "2" ,
                "0"
            ))

        //
        list.add(
            Question(
                "ចូរគណនាកន្សោមខាងក្រោម\n" +
                        "45 + 6x5 -3x12  = ?",
                "36",
                "42",
                "39" ,
                "39"
            ))

        //
        list.add(
            Question(
                "52% នៃ 135 ស្មើនិង?",
                "73.2",
                "70.2",
                "75.2" ,
                "70.2"
            )
        )

        //
        list.add(
            Question(
                "ចូរដោះស្រាយប្រព័ន្ធសមីការខាងក្រោម\n"+
                        "x + 2y =2\n" +
                        "x + y = 0",
                "(x , y) = (-2,2)",
                "(x , y) = (-1,2)",
                "(x , y) = (-4,1)",
                "(x , y) = (-2,2)"
            )
        )
        //
        list.add(
            Question(
            "ចូរគណនាកន្សោមខាងក្រោម\n" +
                    "2-4(2x6) = ?"
                 ,"-46"
                 ,"46"
                ,"-24"
                ,"-46"
        ))

        //
        list.add(
            Question(
                "ចូរគណនាកន្សោមខាងក្រោម\n" +
                        "4x6 + 18÷3 -3x5 = ?"
                ,"22"
                ,"17"
                ,"15"
                ,"15"
            ))

        //
        list.add(Question(
            "ចូរគណនាតម្លៃ x \nបើ 6x - 18 = 12 "
            ,"-4"
            ,"5"
            ,"6"
            ,"5"
        ))

        //
        list.add(Question(
            "ចូរគណនាកន្សោមខាងក្រោម\n" +
                    "2+4(2x6) = ?"
            ,"72"
            ,"60"
            ,"50"
            ,"50"
        ))

        //
        list.add(
            Question(
                "ចូរដោះស្រាយប្រព័ន្ធសមីការខាងក្រោម\n"+
                        "4x + 6y =10\n" +
                        "x - 2y = -1",
                "(x , y) = (-1,1)",
                "(x , y) = (-1,-2)",
                "(x , y) = (1,1)",
                "(x , y) = (1,1)"
            )
        )

        //
        list.add(Question(
            "ចូរគណនាកន្សោមខាងក្រោម\n" +
                    "2x4 + 5(2x6) = ?"
            ,"156"
            ,"68"
            ,"176"
            ,"68"
        ))

        //
        list.add(Question(
            "25% នៃ 150 ស្មើនិង? "
            ,"37.5"
            ,"50"
            ,"35"
            ,"37.5"
        ))

        //
        list.add(Question(
            "ចូរគណនាតម្លៃ x \nបើ 5x + 45 = 55 "
            ,"-2"
            ,"2"
            ,"3"
            ,"2"
        ))

        //
        list.add(Question(
            "20% នៃ 108 ស្មើនិង? "
            ,"21.6"
            ,"22.6"
            ,"24.6"
            ,"21.6"
        ))

        //
        list.add(Question(
            "ចូរគណនាតម្លៃ x \nបើ 3x + 6 =0 "
            ,"2"
            ,"-2"
            ,"1"
            ,"-2"
        ))

        //
        list.add(
            Question(
                "ចូរគណនាកន្សោមខាងក្រោម\n" +
                        "4x5 - 24÷4 -6x5 = ?"
                ,"-24"
                ,"-16"
                ,"16"
                ,"-16"
            ))

        //
        list.add(Question(
            "83% នៃ 170 ស្មើនិង? "
            ,"141.1"
            ,"143.2"
            ,"114.5"
            ,"141.1"
        ))

        //
        list.add(Question(
            "ចូរគណនាតម្លៃ x \nបើ 8x + 4 =4x "
            ,"2"
            ,"1"
            ,"-1"
            ,"-1"
        ))

        //
        list.add(Question(
            "ចូរគណនាកន្សោមខាងក្រោម\n" +
                    "(2022² - 2021²) ÷ 5 = ?"
            ,"808.5"
            ,"808.7"
            ,"808.6"
            ,"808.6"
        ))

        //
        list.add(Question(
            "ចូរគណនាតម្លៃ x \nបើ 9x + 6 =3 "
            ,"-1/3"
            ,"1/3"
            ,"-3"
            ,"-1/3"
        ))

        //
        list.add(Question(
            "ចូរគណនាតម្លៃ x \nបើ 5x - 5 =3 "
            ,"-8/5"
            ,"8/3"
            ,"8/5"
            ,"8/5"
        ))

        //
        list.add(Question(
            "ចូរគណនាបរិមាណចតុកោណកែង\n" +
                    "បើទទឹងមានប្រវែង=10 ,និងបណ្តោយ=12 ?"
            ,"44"
            ,"22"
            ,"36"
            ,"44"
        ))

        //
        list.add(Question(
            "ចូរគណនាកន្សោមខាងក្រោម\n" +
                    "(1000² - 2000²) x 4 = ?"
            ,"-4000"
            ,"-6000000"
            ,"-6200000"
            ,"-6000000"
        ))


        //
        list.add(Question(
            "ចូរគណនាបរិមាណចតុកោណកែង\n" +
                    "បើទទឹងមានប្រវែង=15 ,និងបណ្តោយ=20 ?"
            ,"35"
            ,"70"
            ,"60"
            ,"70"
        ))

        //
        list.add(Question(
            "ចូរគណនាតម្លៃ c \nបើ 4c + 4 =4 "
            ,"0"
            ,"1"
            ,"-1"
            ,"0"
        ))

        val random = Random.nextInt(2)
        if (random ==0){
            list.reverse()
        }


        Log.d("Size ",list.size.toString())

        return list
    }
}